app/controllers/bought_stock_controller.rb

SELECT * FROM "stocks"
---
  def index
    @stocks = Stock.all

SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
SELECT * FROM "stocks"
INSERT INTO "bought_stocks" ("created_at", "quantity", "updated_at", "user_id", "stock_id") VALUES('2010-04-21 05:10:56', 1, '2010-04-21 05:10:56', 1, 3)
SELECT * FROM "bought_stocks" WHERE ("bought_stocks"."user_id" = 1 AND "bought_stocks"."stock_id" = 1) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "bought_stocks" SET "updated_at" = '2010-04-21 05:08:24', "quantity" = 51 WHERE "id" = 1
UPDATE "stocks" SET "updated_at" = '2010-04-23 04:45:27', "value" = 24.21 WHERE "id" = 3
UPDATE "users" SET "updated_at" = '2010-04-21 05:08:15', "cash" = 100000 WHERE "id" = 1
---
  def buy
   @stock = Stock.find(params[:id])
   if current_user.cash < @stock.value
     flash[:note] = "You are BROKE!"
     redirect_to :action => "index"
     return
   end
   current_user.cash -= @stock.value
   @buy = BoughtStock.find_or_create_by_user_id_and_stock_id (current_user.id, @stock.id)
   @buy.quantity = (@buy.quantity || 0)+1
   current_user.save

SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
SELECT * FROM "bought_stocks" WHERE ("bought_stocks"."id" = 1)
SELECT * FROM "stocks"
UPDATE "stocks" SET "updated_at" = '2010-04-23 04:43:34', "value" = 4.35 WHERE "id" = 1
UPDATE "users" SET "updated_at" = '2010-04-21 07:09:02', "cash" = 99859 WHERE "id" = 1
UPDATE "bought_stocks" SET "updated_at" = '2010-04-21 07:09:02', "quantity" = 50 WHERE "id" = 1
---
  def sell
    @stock = Stock.find(params[:id])
    @sell = BoughtStock.find(@stock.id)
    if @sell.quantity <= 0
      flash[:note] = "No more stocks to sell!"
      redirect_to :action => "index"
      return
    end
    current_user.cash += @stock.value
    @sell.quantity = @sell.quantity-1
    current_user.save
    @sell.save