app/controllers/real_estate_controller.rb

SELECT * FROM "real_estates" WHERE ("real_estates"."user_id" IS NULL) LIMIT 1
---
  def index
    @real_estate =  current_user.real_estates.all

SELECT * FROM "real_estates" WHERE ("real_estates"."user_id" IS NULL AND "real_estates"."id" = '132') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-04-21 21:46:36', "cash" = 35045 WHERE "id" = 1
UPDATE "real_estates" SET "updated_at" = '2010-04-21 21:46:36', "user_id" = 1 WHERE "id" = 63
---
  def buy

    @buy = RealEstate.find_by_user_id_and_id(nil, params[:id])
    if not @buy
      flash[:note] = "Too slow! It just sold!"
      redirect_to :action => 'index"'
      return
    end
    if current_user.cash < @buy.cost
     flash[:note] = "You are BROKE!"
     redirect_to :action => "index"
     return
    end
    current_user.cash -= @buy.cost
    @buy.user_id = current_user
    current_user.save
    @buy.save

SELECT * FROM "real_estates" WHERE ("real_estates"."user_id" = 1 AND "real_estates"."id" = '132') LIMIT 1
DELETE FROM "real_estates" WHERE ("id" IN (70))
UPDATE "users" SET "updated_at" = '2010-04-21 22:09:02', "cash" = 100000 WHERE "id" = 1
---
  def sell
    @sell = RealEstate.find_by_user_id_and_id(current_user.id, params[:id])
    if @sell == nil
      flash[:note] = "HAXXXXXX!!!"
      redirect_to :action => "index"
      return
    end
    current_user.cash += @sell.cost
    @sell.delete
    current_user.save