app/controllers/session_controller.rb

SELECT * FROM "users" WHERE ("users"."password" = 'password' AND "users"."login" = 'kirk') LIMIT 1
---
  def login
    user=User.find_by_login_and_password(params[:login], params[:password])