app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user].merge({:cash => 500}))
    @user.job_hours = @user.hours_worked
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "job_hours", "job", "cash", "login", "password") VALUES('Superman', '2010-04-24 04:33:09', '2010-04-24 04:33:09', 5, 'high', 500, 'will', 'password')